config.org
#+title: Mijn Configuratie
#+author: Roel Hemerik
#+email: myconf@roelweb.com
#+latex_class: book
#+latex_header_extra: \usepackage[autooneside=false,automark,headsepline]{scrlayer-scrpage}
#+property: header-args:emacs-lisp
#+property: header-args:elisp :results replace :export code
#+property: header-args:shell :tangle "setup.sh"
#+property: header-args :tangle no :mkdirp yes :comments both :results silent :eval no-export

#+startup: fold

* Doom Emacs

For now, I use [[https://github.com/doomemacs/doomemacs][Doom Emacs]] to configure emacs.

** Packages
:PROPERTIES:
:header-args:elisp: :tangle "packages.el"
:END:

#+begin_src elisp :comments none
;;; $DOOMDIR/packages.el -*- lexical-binding: t; -*-
#+end_src

*** Enabling packages

#+begin_src elisp
(package! homebrew-mode)

(package! company-nginx)
(package! nginx-mode)
(package! x509-mode)

(package! tidal)
(package! xkcd)

(package! poly-markdown)
(package! polymode)
(package! ob-fsharp)

(package! org-tree-slide)

(package! evil-cleverparens)

(package! eglot-fsharp)
(package! bicep-ts-mode)

(package! mmm-mode)

(package! swagg)

(package! kurecolor)

(package! org-cv
  :recipe (:type git
           :host gitlab
           :repo "Titan-C/org-cv"
           :files ("*.el")))

(package! unison-ts-mode
  :recipe (:type git
           :host github
           :repo "fmguerreiro/unison-ts-mode"
           :files ("*.el")))
#+end_src

*** Disabling default packages

#+begin_src elisp
(package! evil-escape :disable t)
#+end_src

** Configuration
:PROPERTIES:
:header-args:elisp: :tangle "config.el"
:END:

This section defines the ~config.el~ file.

#+begin_src elisp :comments none
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-

(load! "./nix-deps.el")
#+end_src

| Macro            | Description                                                   |
|------------------+---------------------------------------------------------------|
| ~load!~          | Load an external *.el file relative to the configuration.     |
| ~use-package!~   | To configure packages.                                        |
| ~after!~         | Running code after a package has loaded.                      |
| ~add-load-path!~ | Adding directories to the ~load-path~, relative to this file. |
| ~map!~           | Adding bindings.                                              |

*** Personal Information

#+begin_src elisp
(setq user-full-name "Roel Hemerik"
      user-mail-address "roel@shared.nl")
#+end_src

**** CV

#+begin_src elisp :tangle no
(use-package! ox-altacv
  :load-path "~/.doom.d/.local/straight/build-29.4/org-cv/"
  :init (require 'ox-altacv))
#+end_src

*** Tuning

This section concerns properties that

**** Garbage Collection

#+begin_src elisp
(after! gcmh
  (setq gcmh-high-cons-threshold (* 64 1024 1024)))
#+end_src

**** LSP

#+begin_src elisp
(setq read-process-output-max  (* 1024 1024)
      lsp-file-watch-threshold 2000)
#+end_src

*** Tools and Utils

**** Settings (~myconf~)

Some utility functions to manage this configuration. Might be a good idea to migrate this to a separate package in the future.

***** Configuration Variables

Here, define the configuration variables for the function we define later on.

#+begin_src elisp
(defconst myconf-config-org-file "~/.myconf/config.org"
  "The location of the config literal file.")

(defvar myconf-open-config-in-other-frame nil
  "Whether to open the config literal file in a new frame")

(defvar myconf-config-frame-name "Settings"
  "The name of the frame in which the settings should be opened.
Only has an effect of ~myconf-open-config-in-other-frame~ is non-nil")

(defvar myconf-config-workspace-name "*settings*"
  "The name of the workspace in which the settings will be opened.")
#+end_src

***** Open Settings

These functions allow me to quickly open this configuration from anywhere.

#+begin_src elisp
(defun myconf-open-config-org ()
  "Open the myconf literal file."
  (interactive)
  (if myconf-open-config-in-other-frame
      (let ((frame (find-file-other-frame myconf-config-org-file)))
        (modify-frame-parameters nil `((fullscreen . fullscreen)
                                       (name . "Settings"))))
      (+workspace-switch myconf-config-workspace-name t)
      (find-file myconf-config-org-file)))
#+end_src

Bind this to the workspace prefix.

#+begin_src elisp
(map! :leader
      :desc "Settings Workspace" "TAB ," #'myconf-open-config-org)
#+end_src

On MacOS, it should open the configuration just like any other application.

#+begin_src elisp
(map! "s-," #'myconf-open-config-org)
#+end_src

**** Uuid

Inspired by:

#+begin_src elisp
(defun xah-insert-random-uuid ()
  "Insert a UUID.
This commands calls “uuidgen” on MacOS, Linux, and calls PowelShell on Microsoft Windows.
URL `http://xahlee.info/emacs/emacs/elisp_generate_uuid.html'
Version: 2020-06-04 2023-05-13"
  (interactive)
  (cond
   ((eq system-type 'windows-nt)
    (shell-command "pwsh.exe -Command [guid]::NewGuid().toString()" t))
   ((eq system-type 'darwin) ; Mac
    (shell-command "uuidgen" t))
   ((eq system-type 'gnu/linux)
    (shell-command "uuidgen" t))
   (t
    ;; code here by Christopher Wellons, 2011-11-18.
    ;; and editted Hideki Saito further to generate all valid variants for "N" in xxxxxxxx-xxxx-Mxxx-Nxxx-xxxxxxxxxxxx format.
    (let ((xstr (md5 (format "%s%s%s%s%s%s%s%s%s%s"
                              (user-uid)
                              (emacs-pid)
                              (system-name)
                              (user-full-name)
                              (current-time)
                              (emacs-uptime)
                              (garbage-collect)
                              (buffer-string)
                              (random)
                              (recent-keys)))))
      (insert (format "%s-%s-4%s-%s%s-%s"
                      (substring xstr 0 8)
                      (substring xstr 8 12)
                      (substring xstr 13 16)
                      (format "%x" (+ 8 (random 4)))
                      (substring xstr 17 20)
                      (substring xstr 20 32)))))))
#+end_src

But I need it also in lowercase.

#+begin_src elisp
(defun roelhem/random-uuid ()
  (substring (shell-command-to-string "uuidgen") 0 -1))

(defun roelhem/random-lowercase-uuid ()
  (downcase (roelhem/random-uuid)))

(defun roelhem/insert-random-uuid-lowercase ()
  "Insert a lowercase UUID"
  (interactive)
  (insert (roelhem/random-lowercase-uuid)))
#+end_src

**** JWT-tokens

***** Get JWT Body

#+begin_src elisp
(defun jwt-parse-string (value &rest args)
  (let* ((parts (string-split value "\\."))
         (nth-decoded (lambda (n)
                        (apply 'json-parse-string
                         (base64-decode-string (nth n parts) t)
                         :object-type 'plist
                         :array-type 'list
                         args))))
    (append (mapcar nth-decoded '(0 1)) (nth 2 parts))))
#+end_src

**** Azure

***** Login

#+begin_src elisp
(defun az-login ()
  (shell-command "az login --allow-no-subscriptions"))
#+end_src

***** OAuth2

****** Client Credential Flow


***** Getting Microsoft Graph Access Token

#+begin_src elisp
(defun ms-graph--get-access-token (&rest scopes)
  "Returns a new ms-graph access token."
  (let ((command "az account get-access-token --resource-type ms-graph --query accessToken --output tsv ")
        (scope-str (string-join (cons "--scope" scopes) " ")))
    (substring (shell-command-to-string (concat command scope-str)) 0 -1)))
#+end_src

***** CLI Transient

#+begin_src elisp :tangle no
(transient-define-prefix az-transient ()
  "Transient for the Azure az command line."
  :info-manual "THe az command line"
  [("q" "Quit" transient-quit-one)])

(transient-define-argument az-transient--output-a ()
  :description "Output format."
  :class 'transient-option
  :shortarg "-o"
  :argument "--output="
  :choices '("json" "jsonc" "none" "table" "tsv" "yaml" "yamlc")
  :default "json")
#+end_src

****** Account

#+begin_src elisp :tangle no
(transient-define-prefix az-account ()
  "Transient for the Azure ~az account~ cli."
  :info-manual "az account"
  ["Global Arguments"
   ("-h" "Show help message and exit." "--help")
   (az-transient--output-a)
   ("-q" "JMESPath query string." "--query")]
  ["Commands"
   ("ss" "Show" transient-quit-one)])
#+end_src

***** Keybindings

#+begin_src elisp :tangle no
(map! :leader
      :prefix "o"
      :desc "AZ cli" "s-a" #'az-transient)
#+end_src

**** Swagg

This is an amazing package by [[https://isamert.net][Isa Mert Gurbuz]] that works as a swagger ui inside emacs.

***** Setup

#+begin_src elisp
(use-package! swagg
  :commands (swagg-request
             swagg-display-headers
             swagg-request-with-rest-block
             swagg-invalidate-cache))
#+end_src

***** APIs

#+begin_src elisp
(setq
 swagg-definitions
 '((:name "GitHub"
    :json "https://raw.githubusercontent.com/github/rest-api-description/main/descriptions/api.github.com/api.github.com.json"
    :base "https://api.github.com")
   (:name "Azure AppConfiguration [stable v1.0]"
    :json "https://raw.githubusercontent.com/Azure/azure-rest-api-specs/main/specification/appconfiguration/data-plane/Microsoft.AppConfiguration/stable/1.0/appconfiguration.json")
   (:name "Azure WebPubSub [stable 2023-07-01]"
    :json "https://raw.githubusercontent.com/Azure/azure-rest-api-specs/main/specification/webpubsub/data-plane/WebPubSub/stable/2023-07-01/webpubsub.json")
   (:name "Azure KeyVault BackupRestore [stable v7.4]"
    :json "https://raw.githubusercontent.com/Azure/azure-rest-api-specs/main/specification/keyvault/data-plane/Microsoft.KeyVault/stable/7.4/backuprestore.json")
   (:name "Azure KeyVault Certificates [stable v7.4]"
    :json "https://raw.githubusercontent.com/Azure/azure-rest-api-specs/main/specification/keyvault/data-plane/Microsoft.KeyVault/stable/7.4/certificates.json")
   (:name "Azure KeyVault Common [stable v7.4]"
    :json "https://raw.githubusercontent.com/Azure/azure-rest-api-specs/main/specification/keyvault/data-plane/Microsoft.KeyVault/stable/7.4/common.json")
   (:name "Azure KeyVault Keys [stable v7.4]"
    :json "https://raw.githubusercontent.com/Azure/azure-rest-api-specs/main/specification/keyvault/data-plane/Microsoft.KeyVault/stable/7.4/keys.json")
   (:name "Azure KeyVault RBAC [stable v7.4]"
    :json "https://raw.githubusercontent.com/Azure/azure-rest-api-specs/main/specification/keyvault/data-plane/Microsoft.KeyVault/stable/7.4/rbac.json")
   (:name "Azure KeyVault Secrets [stable v7.4]"
    :json "https://raw.githubusercontent.com/Azure/azure-rest-api-specs/main/specification/keyvault/data-plane/Microsoft.KeyVault/stable/7.4/secrets.json")
   (:name "Azure KeyVault SecurityDomain [stable v7.4]"
    :json "https://raw.githubusercontent.com/Azure/azure-rest-api-specs/main/specification/keyvault/data-plane/Microsoft.KeyVault/stable/7.4/securitydomain.json")
   (:name "Azure KeyVault Settings [stable v7.4]"
    :json "https://raw.githubusercontent.com/Azure/azure-rest-api-specs/main/specification/keyvault/data-plane/Microsoft.KeyVault/stable/7.4/settings.json")
   (:name "Azure KeyVault Storage [stable v7.4]"
    :json "https://raw.githubusercontent.com/Azure/azure-rest-api-specs/main/specification/keyvault/data-plane/Microsoft.KeyVault/stable/7.4/storage.json")))
#+end_src

Sources:
 - [[https://github.com/Azure/azure-rest-api-specs][Azure REST-API Specs GitHub-repository]]

**** Htmlize

#+begin_src elisp
(setq htmlize-html-major-mode 'web-mode
      htmlize-css-name-prefix "emacs-")
#+end_src

**** NX

#+begin_src elisp
(load! "~/.myconf/emacs/lisp/nx-mode.el")

(map! :leader
      "p n f" #'nx-project-find-file
      "p n R" #'nx-project-run-target)
#+end_src

*** Appearance

This section configures how emacs looks.

**** Theme

This sets the default theme for emacs.

#+begin_src elisp
(setq doom-theme 'one-dark)
#+end_src

To load another theme, use the ~load-theme~ function (=SPC h t=).

**** Colors

I am missing some colors!

***** One Dark

These are the colors of the original OneDark theme from Atom which I am used to.

#+begin_src elisp
(defconst one-dark-colors
  '(
    (coral . "#e06c75")
    (vivid-coral . "#ef596f")
    (dark . "#5c6370")
    (deep . "#23272e")
    (invalid . "#ffffff")
    (light-dark . "#7f848e")
    (light-white . "#abb2bf")
    (malibu . "#61afef")
    (deep-red . "#be5046")
    (black . "#282c34")
    (white . "#abb2bf")
    (light-green . "#afc3a1")
    (green . "#98c379")
    (dim-green . "#626e59")
    (vivid-green . "#89ca78")
    (error-red . "#f44747")
    (light-red . "#e06c75")
    (dark-red . "#be5046")
    (chalky . "#e5c07b")
    (light-yellow . "#e5c07b")
    (wiskey . "#d19a66")
    (dark-yellow . "#d19a66")
    (vivid-fountain-blue . "#2bbac5")
    (fountain-blue . "#56b6c2")
    (blue . "#61afef")
    (purple . "#c678dd")
    (magenta . "#c678dd")
    (vivid-purple . "#d55fde")
    (pink . "#c44482")
    (cyan . "#56b6c2")
    (gutter-gray . "#4b5263")
    (comment-gray . "#5c6370")))
#+end_src

The following function makes it easier to access these colors:

#+begin_src elisp
(defun one-dark-color (name)
  "Selects one of the original one-dark colors with name NAME."
  (alist-get name one-dark-colors))
#+end_src

**** Font faces

***** Fonts

Fonts can be set using the following variables. /Source: The default emacs =config.el= file./

| variable                   | description                                                        |
|----------------------------+--------------------------------------------------------------------|
| ~doom-font~                | The primary font to use.                                           |
| ~doom-variable-pitch-font~ | a non-monospace font (where applicable)                            |
| ~doom-big-font~            | Used for ~doom-big-font-mode~ (during presentations or streaming). |
| ~doom-unicode-font~        | To show unicode glyphs                                             |
| ~doom-serif-font~          | For the ~fixed-pitch-serif~ face.                                  |


#+begin_src elisp
(setq doom-font (font-spec :family "Fira Code" :size 15 :weight 'regular)
      doom-variable-pitch-font (font-spec :family "Fira Sans" :size 15))
#+end_src

Using ~s-=~ and ~s--~, changes the font size (default from /doom-emacs/). Lets make the step
as small as possible.

#+begin_src elisp
(setq doom-font-increment 1)
#+end_src

